Repository: nivbend/memoir
Catalog: locale/*/LC_MESSAGES/django.po
Languages: he

source: English
he: אנגלית

source: Hebrew
he: עברית

source: Login
he: התחבר

source: Quotes
he: ציטוטים

source: Mentions
he: איזכורים

source: and
he: ו

# Quote
source: title
he: כותרת

# Quote
source: text
he: ציטוט

# Comment
source: text
he: הערה

source: Add Quote
he: שלח ציטוט

source: Create
he: צטט

source: Likes:
he: אהבו:

source: What do you have to say?
he: מה יש לך להגיד?

source: Comment
he: שלח

source: Update
he: ערוך

source: Cancel
he: בטל

source: Update
he: ערוך

source: You and
he: את/ה ו

source: You,
he: את/ה,

source: You
he: את/ה

source: Edit
he: ערוך

source: Delete
he: מחק

source: %(t)s ago
he: לפני %(t)s

source: Are you certain you want to delete the quote?
he: האם את/ה בטוח/ה שאת/ה רוצה למחוק את הציטוט?

source: I'm sure
he: אני בטוח/ה

source: About Memoir
he: על Memoir

source: This is a quotes server made with &lt;3 by Niv Ben-David.
he: בפניכם שרת לשמירת ציטוטים, הוכן ב-3&gt; ע"י ניב בן-דוד.

source: For any issues, remarks, suggestions or otherwise, please see:
he: לכל בעיה, הערה או הצעה, ניתן לפנות לכתובת:

source: No boards, apparently
he: אין קבוצות, כנראה

source: Recent
he: אחרונים

source: Top
he: נבחרים

source: Logged in as
he: מחובר/ת כ

source: switch
he: החלף משתמש

source: %(counter)s comment
he: הערה אחת

source: By
he: ע"י

source: on
he: ב
